MOTIVATION_MESSAGES = [
    "Отлично. Продолжай в том же духе.",
    "День перед победой выглядит так же, как день перед провалом.",
    "Каждый час работы приближает тебя к цели.",
    "Не сбавляй темп. Ты уже движешься вперёд.",
]

CANCEL_END_DAY_TEXT = (
    "Хорошо.\n"
    "Возвращаемся к выполнению плана."
)

CONFIRM_END_DAY_TEXT = (
    "Хорошо.\n"
    "Иногда завершить день раньше действительно необходимо.\n"
    "Но обязательно подумай:\n"
    "Что именно стало причиной?\n"
    "Можно ли было этого избежать?\n"
    "Что нужно изменить завтра?\n"
    "Запиши свои мысли в дневник.\n"
    "Отдыхай и восстанавливайся.\n"
    "Завтра начинаем заново."
)

SHORT_BREAK_END_TEXT = (
    "Перерыв окончен. Продолжаем работу."
)

SHORT_BREAK_SKIP_TEXT = (
    "Короткий перерыв завершён досрочно."
)

BIG_BREAK_SKIP_TEXT = (
    "Перерыв завершён досрочно."
)

PREP_SKIP_TEXT = (
    "Подготовка завершена досрочно."
)

SELF_CONTROL_QUESTION = (
    "Вопрос к тебе.\n\n"
    "Выкладываешься ли ты на полную?\n"
    "Делаешь ли ты всё необходимое для достижения результата?\n"
    "Не тратишь ли время впустую?\n"
    "Проводишь ли ты его с пользой?\n"
    "Ответь себе честно: доволен ли ты собой прямо сейчас?"
)

PREPARATION_WARNING_TEXT = (
    "Через 10 минут тебе нужно будет приступить к занятию.\n\n"
    "Старайся придерживаться графика и укладываться в отведённое время.\n"
    "Поэтому заканчивай текущие дела и постепенно готовься к следующему этапу.\n"
    "У тебя всё получится. Главное — двигаться вперёд, не опускать руки и не зацикливаться на ошибках."
)

BIG_BREAK_WARNING_TEXT = (
    "Большой перерыв подходит к концу.\n"
    "Постепенно возвращайся в рабочий режим.\n"
    "Подготовь рабочее место и настройся на следующий блок."
)

BIG_BREAK_FINISHED_TEXT = (
    "Большой перерыв завершён.\n"
    "Надеюсь, тебе удалось восстановить силы.\n"
    "Пора возвращаться к работе."
)

WORK_BLOCK_1_TEXT = (
    "Начало положено.\n"
    "Впереди тебя ждёт серьёзная работа, но не переживай — ты справишься.\n"
    "Сейчас самое важное — не лениться и выкладываться на максимум.\n"
    "Ты закладываешь фундамент, который будет работать на тебя ещё долгие годы."
)

WORK_BLOCK_2_3_TEXT = (
    "Хорош. Ты уже дошёл до этого этапа и сделал большое дело.\n"
    "Сейчас может появляться усталость, желание отвлечься или отложить работу.\n\n"
    "Но помни: день перед победой выглядит точно так же, как день перед поражением."
)

WORK_BLOCK_4_TEXT = (
    "Здорово.\n"
    "Ты уже проделал огромную работу.\n"
    "Остался последний рывок.\n"
    "Постарайся закончить этот день максимально продуктивно."
)

SECOND_HALF_WORK_TEXT = (
    "Ты уже проделал часть пути.\n"
    "Сейчас важно сохранить концентрацию и не расслабляться раньше времени.\n"
    "Постарайся провести это время максимально продуктивно."
)